{
  "projects": [
    {
      "id": "1",
      "img": "atlatnt-img.png",
      "name": "AtlantBH Internship 23-24",
      "description": "I was able to participate in AtlantBH internship as a UX & UI Designer and learn about design process, where I was mentored by amazing individuals who helped me improve my design skills. I was able to work on two different designs, mobile transport application and auction application for web platform.",
      "role": "UX&UI Designer",
      "startDate": "09.10.2023",
      "endDate": "26.01.2024",
      "pageLink": "",
      "gitLink": "",
      "color": "orange"
    },
    {
      "id": "2",
      "img": "rubicon_internship.png",
      "name": "RUBICON Summer Internship 2023",
      "description": "Summer after graduation, I was accepted to the RUBICON Summer Internship 2023 Program, to work on a \"real\" project (more information soon). I was able to work on a, soon to be live, project with a group of an amazing individuals with some of the top-line mentors helping me improve my skills.",
      "role": "Frontend Developer",
      "startDate": "12.06.2023",
      "endDate": "31.07.2023",
      "pageLink": "",
      "gitLink": "",
      "color": "greenyellow"
    },
    {
      "id": "3",
      "img": "dokumenta_project.png",
      "name": "Dokumenta",
      "description": "This project was done for the purpose of Good Hackathon that was organised by telemach foundation. My team and I were able to create fully functional application using NextJS, NodeJS and PostgreSQL. The main purpose of our application was to make easier and more convenient way of acquiring documents from municipality without having to wait in lines for several hours.",
      "role": "Full Stack Developer",
      "startDate": "15.10.2022",
      "endDate": "16.10.2022",
      "pageLink": "",
      "gitLink": "https://github.com/farisbegic/dokumenta",
      "color": "purple"
    },
    {
      "id": "4",
      "img": "sportnet-img.png",
      "name": "Sportnet",
      "description": "This project is showcasing my undergraduate thesis work on Progressive Web Applications. This project currently in development, more info soon! I was able to create a fully working prototype of a social-media platform for sport enthusiasts using ReactJS for frontend, NodeJS with Express for backend and PostgreeSQL for database.",
      "role": "Full Stack Developer",
      "startDate": "01.02.2023",
      "endDate": "Ongoing",
      "pageLink": "",
      "gitLink": "",
      "color": "purple"
    }
  ]
}
